{
    "blogs" : [
    {
        "id" : "Blog 1",
        "title" : "Blog Post #1",
        "date" : "Date: 2/25/2018",
        "strengths" : "After going over Git and GitHub with the instructors I feel more comfortable with it than I did after the treehouse course. I feel that I am able to conceptualize most/all of what is being taught, except for the difference between red and green apparently!",
        "weaknesses" : "Styling images! Christ! I'm not sure if it is attempting to mimic another site using their source material or what but I have been struggling with the sizing of images. Page layout is going to be my biggest downfall, or really where I need to spend most of my time practicing. Hoping that utilizing flexbox on my own site will prove more fruitful for my understanding of layout and image/div sizing.",
        "notes" : "It may be, that a better way to size images is by utilizing background-image in CSS. Requires a div to have set width and heigh though."
    },
    {
        "id" : "Blog 2",
        "title" : "Blog Post #2",
        "date" : "Date: 3/9/2018",
        "strengths" : "JavaScript logic. I feel relatively comfortable with the concepts of JavaScript that we have learned so far. I think my strengths will primarily lie within the realm of JavaScript over CSS styling. I have felt good about our group communication as well. Everyone is putting the time in and willing to ask questions/help out.",
        "weaknesses" : "More advanced JavaScript. While I just said JavaScript was where my strength lie, it is also where I have plenty of glaring weaknesses. There is a lot to learn and I've only just scratched the tip. Recently I've been frustrated with the .filter() function. I also need to be careful creating infinite loops. Is doesn't happen often but when it does, oh man does it!",
        "notes" : "When fixing an infinite loop, make sure to clear you're browsers cache. Even after fixing the issue and starting a localhost on a different port, depending on where the loop is being loaded it can persist in your cache."
    },
    {
        "id" : "Blog 3",
        "title" : "Blog Post #3",
        "date" : "Date: 3/9/2018",
        "strengths" : "Not sure there are any new updates in this category. Certainly have more weaknesses to discuss! YAY!",
        "weaknesses" : "Knowing when to take a break! I struggled with a loop for an hour and a half, fixed the issue but became frustrated with myself. I then attempted to wrestle with a new concept. BAD IDEA when you're already frustrated. I need to identify when I need to switch gears and work on something else. Part of the issue is that I don't like to leave things unfinished. Probably going to have to learn that this is an inevitability.",
        "notes" : "JavaScript is awesome when it works and you comprehend whats being done. JavaScript SUCKS when you don't."
    },
    {
        "id" : "Blog 4",
        "title" : "Blog Post #4",
        "date" : "Date: 3/30/2018",
        "strengths" : "I have become more comfortable with my JavaScript knowledge. Looking at loops and other people's functions has started to feel more intuitive. I am sure right as I say this Zoe & Co. will introduce a new concept that will throw me for a loop....punny!",
        "weaknesses" : "CSS is still a struggle. I understand the concepts, how to write it and many properties, but getting a page to lay out how I want it too is taking more time than it should.",
        "notes" : "It's okay to be bested by the code and ask for help, as long as you've struggled with it for awhile. Your understanding of the material will increase through wrestling with the material even if you need an instructor to make the code run."
    },
    {
        "id" : "Blog 5",
        "title" : "Blog Post #5",
        "date" : "Date: 3/31/2018",
        "strengths" : "The introduction of JSON has made sense so far. Chaining of functions is intuitive but I need more practice.",
        "weaknesses" : "Organization of functions in JS. Setting them up in the proper order can feel a bit counter intutive currently. Another weakness is identifying multiple way to grab the data I'm after rather than thinking to turn back to the JSON object right away.",
        "notes" : "Things N' Stuff. Also Ron Swanson is my Hero."
    },
    {
        "id" : "Blog 6",
        "title" : "Blog Post #6",
        "date" : "Date: 4/9/2018",
        "strengths" : "Holding back shower tears.....just kidding. Things are going pretty well so far. I'm really enjoying everything so far. JavaScript is certainly my strength relative to CSS styling. I enjoy the problem solving and logic of JavaScript. I feel fairly good about my troubleshooting abilities, except for this week when I needed to ask Lauren for help. Didn't know to look for the mistake I was making, makes it hard to resolve huh?!?!",
        "weaknesses" : "Still CSS >.< I am getting a bit better at CSS layout with bootstrap. I have started reading the bootstrap documentation and it has been helping. Another weakness is remember that my XHR request cannot call ES6 functions! Bad ES6, Bad!",
        "notes" : "READ READ READ! All the CSS styling. Keep reading it, you need it! Also practice it!"
    },
    {
      "id" : "Blog 7",
      "title" : "Blog Post #7",
      "date" : "Date: 4/14/2018",
      "strengths" : "Got a positive review from the instructors last week. Was nice to know where the instructors view my progress through the program, instead of my own self deprecating version. I truly enjoy working with JavaScript, I'm excited to dive into C# later on in the program.",
      "weaknesses" : "Had a bit of a freakout with Bootstrap 3 the other day. It was resolved, thankfully. After this event my understand of Bootstrap has increased a fair amount. Styling is still the major challenge for me. I wish we were using Bootstrap 4 at this point. Not utilizing Flexbox's amazingness seems wasteful.",
      "notes" : "Put a bit more time in so that you can ask the instructors for challenges. They expect you to be asking them for more. Push yourself man, don't get complacent."
  }
]
}